{
  "attributes": {
  },
  "providing": {
  },
  "platforms": {
    "debian": ">= 0.0.0",
    "ubuntu": ">= 0.0.0"
  },
  "recipes": {
  },
  "description": "Installs/Configures elasticsearch-head",
  "replacing": {
  },
  "version": "0.0.1",
  "suggestions": {
  },
  "dependencies": {
    "elasticsearch": ">= 0.0.0",
    "apache2": ">= 0.0.0"
  },
  "name": "elasticsearch-head",
  "groupings": {
  },
  "maintainer_email": "packages@sourceindex.de",
  "maintainer": "SourceIndex IT-Service",
  "conflicting": {
  },
  "license": "Apache 2.0",
  "long_description": "Description\n===========\n\nThis is a simple cookbook to install elasticsearch-head with chef.\n\nelasticsearch-head is a web front end for browsing and interacting with an Elastic Search cluster.\n\n* A ClusterOverview, which shows the topology of your cluster and allows you to perform index and node level operations\n* A couple of search interfaces that allow you to query the cluster a retrieve results in raw json or tabular format\n* Several quick access tabs that show the status of the cluster\n* An input section that allows arbitrary call to the RESTful API to be made. This interface includes several options that can be combined to produce interesting results;\n* Select request method (get, put, post, delete), json query data, node, and path\n* JSON validator\n* Ability to repeat requests on a timer\n* Ability to transform the result using javascript expressions\n* Ability to collect results over time (using timer), or compare results\n* Ability to chart the transformed results in a simple bar graph (including time series)\n\n*caution*, you can destroy and corrupt data from this interface if you are not careful\n\nes-head will attempt to remember the node that it connects to using html5 features, however this only works over http(s).\nIf you would like to create a link to a particular cluster use the url form .../elasticsearch-head/index.html?base_uri=http://cluster.example.com:9200/\n\nRequirements\n============\n\nPlatform\n--------\n\n* Debian, Ubuntu\n\nCookbooks\n---------\n\n* elasticsearch\n* apache2\n\nUsage\n=====\n\nDownload the sources, unpack and upload with 'knife cookbook upload elasticsearch-head'.\n\nSimply include the recipe where ever you would like elasticsearch-head installed.\n\n    name \"elastichead\"\n    description \"Install elasticsearch-head from source\"\n    run_list(\n      \"recipe[elasticsearch-head]\"\n    )\n\nLicense and Author\n==================\n\nAuthor:: Sebastian Wendel\n\nCopyright:: 2012, SourceIndex IT-Services\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n",
  "recommendations": {
  }
}